app/controllers/api/trails_controller.rb

SELECT  "trails".* FROM "trails" WHERE "trails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @trail = Trail.find_by(id: params[:id])