app/views/api/parks/show.json.jbuilder

SELECT "trails".* FROM "trails" WHERE "trails"."park_id" = $1  [["park_id", 1]]
---
json.trails do
    @park.trails.each do |trail|